<template>
  <q-page class="flex flex-center">
    В современном информационном обществе, где объемы текстовой информации
    постоянно растут, интеллектуальный анализ текстов занимает центральное место
    в обработке и извлечении ценной информации. Этот подход объединяет в себе
    передовые методы и технологии, направленные на понимание и интерпретацию
    текстовых данных с использованием искусственного интеллекта. В данной работе
    мы рассмотрим ключевые аспекты интеллектуального анализа текстов и его
    применение в области информационной безопасности. Совсем не так давно, после
    введения режима удаленной работы, вызванного пандемией коронавирусной
    инфекции в 2019-2021 годах, произошло резкое увеличение активности
    киберпреступников и числа совершенных ими преступлений. Чаще всего объектами
    кибератак стали организации, работающие в государственной, медицинской и
    промышленной сферах. Множество атак были направлены на коммерческие
    предприятия и банковский сектор. В последние годы в России были утверждены
    ряд нормативно-правовых актов, определяющих требования к обеспечению
    информационной безопасности. Среди них Федеральный закон "О безопасности
    критической информационной инфраструктуры" №187-ФЗ (2017 г.) и несколько
    приказов ФСТЭК России, таких как №31 (2014 г.), №235 и №239 (2017 г.).
    Важным документом является "Методика оценки угроз безопасности информации"
    от 5 февраля 2021 года. Согласно последней версии методики, одним из этапов
    оценки угроз информационной безопасности является анализ возможности их
    реализации и определение их актуальности. Этот этап включает в себя
    выявление источников угроз, то есть выявление актуальных нарушителей, а
    также анализ сценариев возможных атак. В свою очередь, определение сценариев
    атак включает в себя выявление последовательности возможных тактик и
    соответствующих техник, которые могут быть использованы нарушителями с
    определенным уровнем возможностей при эксплуатации уязвимостей. Вместе с
    тем, на практике при решении данной задачи специалисты по информационной
    безопасности встречаются с необходимостью обращения к огромным массивам
    текстовых описаний компонентов (угроз, уязвимостей, тактик, техник),
    размещенных в открытых базах данных (БД). Работа с указанными данными
    предполагает поиск и анализ угроз и уязвимостей в «ручном» режиме. В связи с
    этим разработка новых программных средств, предназначенных автоматизации
    оценки и приоритизации актуальных угроз, уязвимостей, тактик (техник) и
    построения сценариев возможных атак с использованием методов
    интеллектуального анализа текстов, является весьма актуальной как в научном,
    так и в практическом плане. Тем не менее, при решении данной задачи
    практикующие специалисты по ИБ сталкиваются с необходимостью обработки
    обширных текстовых описаний компонентов, таких как угрозы, уязвимости,
    тактики и техники. Эти описания размещены в открытых базах данных.
    Взаимодействие с указанными базами данных подразумевает проведение поиска и
    анализа угроз и уязвимостей в «ручном» режиме, что требует значительных
    временных затрат и подвержено ошибкам, связанным с человеческим фактором. В
    связи с этим возникает естественное стремление специалистов по
    информационной безопасности автоматизировать процесс сопоставления угроз,
    уязвимостей, тактик и техник их эксплуатации. Как правило, проводится
    сопоставление только между двумя компонентами: уязвимостями и
    соответствующими им угрозами. Таким образом, целью выпускной
    квалификационной работы является: разработка программного средства
    визуализации сценариев реализации угроз информационной безопасности на
    основе методов интеллектуального анализа текстов. Основными задачами данной
    работы: – Анализ предметной области; – Обзор современных методов и
    алгоритмов интеллектуального анализа текстов; – Разработка алгоритмов и
    модели системы визуализации сценариев реализации угроз информационной
    безопасности; – Разработка программного средства визуализации сценариев
    реализации угроз информационной безопасности на основе методов
    интеллектуального анализа текстов; – Экспериментальная часть и подготовка
    документации.
  </q-page>
</template>

<script>
import { defineComponent } from "vue";

export default defineComponent({
  name: "IndexPage",
});
</script>
